{
    "intents": [
        {
            "tag": "symptoms",
            "patterns": ["I have a headache", "I feel sick", "I have a fever", "I am not feeling well"],
            "responses": ["I'm sorry to hear that. Can you list all your symptoms?", "Please tell me more about your symptoms so I can assist you better."],
            "action": "check_symptoms"
          },
          {
            "tag": "escalation",
            "patterns": ["I need to speak to a doctor", "Can you escalate this?", "I need urgent help"],
            "responses": ["I will escalate this conversation to a human agent.", "Please hold on while I connect you to a human agent."],
            "action": "escalate_conversation"
          },
          {
            "tag": "medication",
            "patterns": ["What medication should I take?", "Can you recommend any medicine?", "What should I take for a headache?"],
            "responses": ["I'm not a doctor, but you should consult with a healthcare professional for medication advice.", "Please consult with a doctor for the best medication for your symptoms."],
            "action": "provide_medication_advice"
          },
          {
            "tag": "side_effects",
            "patterns": ["What are the side effects of this medication?", "Does this medicine have any side effects?", "What should I expect from this drug?"],
            "responses": ["You should consult the medication's leaflet or a healthcare professional for detailed information on side effects.", "Please ask your doctor or pharmacist about the side effects of this medication."],
            "action": "provide_side_effects_info"
          },
          {
            "tag": "appointment",
            "patterns": ["I need to book an appointment", "Can I schedule a visit?", "How do I make an appointment?"],
            "responses": ["You can book an appointment by calling your healthcare provider or using their online booking system.", "Please contact your doctor's office to schedule an appointment."],
            "action": "book_appointment"
          },
          {
            "tag": "emergency",
            "patterns": ["I have an emergency", "This is urgent", "I need immediate help"],
            "responses": ["If this is a medical emergency, please call emergency services or go to the nearest emergency room.", "For urgent medical issues, please contact emergency services immediately."],
            "action": "handle_emergency"
          },
          {
            "tag": "basic_medical_screening",
            "patterns": ["Can you help me with some basic medical screening?", "I need assistance with medical screening", "Can you provide basic health assessment?"],
            "responses": ["I can help with basic medical screening. Please answer a few questions to assess your health status."],
            "action": "provide_basic_medical_screening"
          },
          {
            "tag": "medical_history",
            "patterns": ["Do you have any existing medical conditions?", "Have you been diagnosed with any health issues?", "What is your medical history?"],
            "responses": ["It's important to provide your healthcare provider with your complete medical history for accurate diagnosis and treatment."],
            "action": "provide_medical_history_info"
          },
          {
            "tag": "allergies",
            "patterns": ["Do you have any allergies?", "Are you allergic to any medications?", "What are your allergies?"],
            "responses": ["Knowing your allergies is important for safe and effective treatment. Please inform your healthcare provider about any allergies you have."],
            "action": "provide_allergies_info"
          },
          {
            "tag": "current_medications",
            "patterns": ["Are you taking any medications?", "What medications are you currently on?", "Do you have a list of your current medications?"],
            "responses": ["It's important to keep a list of your current medications and share it with your healthcare provider to prevent drug interactions and ensure safe treatment."],
            "action": "provide_current_medications_info"
          },
          {
            "tag": "family_history",
            "patterns": ["Do you have a family history of any medical conditions?", "Are there any health issues that run in your family?", "What is your family medical history?"],
            "responses": ["Family history can provide valuable insights into your health risks. Inform your healthcare provider about any family history of medical conditions."],
            "action": "provide_family_history_info"
          },
          {
            "tag": "lifestyle_factors",
            "patterns": ["Do you smoke or drink alcohol?", "What is your lifestyle like?", "Do you exercise regularly?"],
            "responses": ["Lifestyle factors such as smoking, alcohol consumption, and physical activity can impact your health. It's important to maintain a healthy lifestyle for overall well-being."],
            "action": "provide_lifestyle_factors_info"
          },
          {
            "tag": "vaccination",
            "patterns": ["Do I need a vaccine?", "What vaccines should I get?", "Is vaccination necessary?"],
            "responses": ["Vaccinations are important for preventing diseases. Please consult with your healthcare provider to know which vaccines you need.", "Your doctor can provide you with the best advice on vaccinations."],
            "action": "provide_vaccination_info"
          },
          {
            "tag": "symptom_duration",
            "patterns": ["How long will my symptoms last?", "When will I feel better?", "How long does it take to recover?"],
            "responses": ["The duration of symptoms can vary. Please consult with a healthcare professional for an accurate assessment.", "Recovery time depends on the condition. It's best to ask your doctor for more information."],
            "action": "provide_symptom_duration_info"
          }
    ]
}