{
    "intents": [
      {
        "tag": "child_fever",
        "patterns": [
          "My child has a fever, what should I do?",
          "What causes fever in children?",
          "How do I reduce a fever in my child?",
          "When should I be concerned about a fever in kids?"
        ],
        "responses": [
          "Fevers in children are often caused by infections. You can reduce it with acetaminophen or ibuprofen (dosage based on weight) and ensure they stay hydrated. Seek medical care if the fever is high, lasts more than 3 days, or if your child shows concerning symptoms."
        ],
        "action": "provide_fever_info"
      },
      {
        "tag": "child_vaccinations",
        "patterns": [
          "What vaccines does my child need?",
          "Are vaccinations safe for children?",
          "When should my child get vaccinated?",
          "Can you provide a vaccination schedule for kids?"
        ],
        "responses": [
          "Vaccinations protect children from serious diseases. Common vaccines include DTaP, MMR, and polio. Follow your pediatrician's recommended schedule and consult them for any specific concerns."
        ],
        "action": "provide_vaccination_schedule"
      },
      {
        "tag": "common_cold_in_children",
        "patterns": [
          "My child has a cold, how can I help?",
          "What are the symptoms of a cold in kids?",
          "How long does a child's cold last?",
          "What home remedies help with a cold in children?"
        ],
        "responses": [
          "Cold symptoms include runny nose, cough, and mild fever. Encourage rest, hydration, and use a humidifier. If symptoms persist or worsen, consult a pediatrician."
        ],
        "action": "provide_cold_advice"
      },
      {
        "tag": "child_allergies",
        "patterns": [
          "What are common allergies in kids?",
          "How do I know if my child has an allergy?",
          "What should I do if my child has an allergic reaction?",
          "How can I manage my child's allergies?"
        ],
        "responses": [
          "Common allergies in children include food, pollen, and pet dander. Symptoms include sneezing, rash, or difficulty breathing. Consult an allergist for testing and management."
        ],
        "action": "provide_allergy_info"
      },
      {
        "tag": "child_asthma",
        "patterns": [
          "How do I know if my child has asthma?",
          "What triggers asthma in children?",
          "How can I manage my child's asthma?",
          "What are the symptoms of asthma in kids?"
        ],
        "responses": [
          "Asthma symptoms include wheezing, coughing, and shortness of breath. Triggers include allergens, exercise, or cold air. Work with a pediatrician to create an asthma action plan."
        ],
        "action": "provide_asthma_info"
      },
      {
        "tag": "child_nutrition",
        "patterns": [
          "What should my child eat to stay healthy?",
          "How can I ensure my child gets enough nutrients?",
          "What foods are good for kids?",
          "How do I handle a picky eater?"
        ],
        "responses": [
          "A healthy diet includes fruits, vegetables, whole grains, and protein. Limit sugary snacks and encourage balanced meals. For picky eaters, offer a variety of foods and involve them in meal preparation."
        ],
        "action": "provide_child_nutrition_info"
      },
      {
        "tag": "child_sleep",
        "patterns": [
          "How much sleep does my child need?",
          "My child has trouble sleeping, what can I do?",
          "What is a healthy bedtime routine for kids?",
          "Why is my child waking up at night?"
        ],
        "responses": [
          "Children need 9-12 hours of sleep depending on age. Establish a consistent bedtime routine, avoid screens before bed, and create a calm sleeping environment. Persistent issues should be discussed with a doctor."
        ],
        "action": "provide_sleep_advice"
      },
      {
        "tag": "child_behavior_issues",
        "patterns": [
          "Why is my child acting out?",
          "How do I handle tantrums in kids?",
          "What causes behavior problems in children?",
          "How can I improve my child's behavior?"
        ],
        "responses": [
          "Behavioral issues can stem from stress, developmental changes, or unmet needs. Stay calm, set clear boundaries, and encourage positive reinforcement. Consult a pediatrician if concerns persist."
        ],
        "action": "provide_behavior_support"
      },
      {
        "tag": "child_growth_milestones",
        "patterns": [
          "What are normal growth milestones for kids?",
          "When should my child start walking?",
          "Is my child's growth on track?",
          "What should I do if my child is not meeting milestones?"
        ],
        "responses": [
          "Growth milestones vary but include physical, cognitive, and social skills. If you have concerns, discuss them with your child's pediatrician for further evaluation."
        ],
        "action": "provide_growth_milestone_info"
      },
      {
        "tag": "child_skin_conditions",
        "patterns": [
          "What causes rashes in children?",
          "Why does my child have eczema?",
          "How do I treat diaper rash?",
          "My child has dry, itchy skin; what can I do?"
        ],
        "responses": [
          "Rashes in children can result from allergies, infections, or irritants. Keep the skin moisturized and avoid triggers. For persistent or severe conditions, consult a doctor."
        ],
        "action": "provide_skin_condition_info"
      },
      {
        "tag": "child_injuries",
        "patterns": [
          "What should I do if my child gets hurt?",
          "How do I treat a cut or scrape on my child?",
          "My child hit their head, should I be worried?",
          "How can I prevent injuries in kids?"
        ],
        "responses": [
          "For minor injuries, clean and bandage the area. Monitor head injuries closely and seek medical attention for any signs of confusion, vomiting, or persistent pain. Supervise activities to prevent injuries."
        ],
        "action": "provide_injury_first_aid"
      },
      {
        "tag": "child_teething",
        "patterns": [
          "When do babies start teething?",
          "How do I soothe a teething baby?",
          "Why is my baby drooling so much?",
          "What are the signs of teething?"
        ],
        "responses": [
          "Teething often starts around 6 months and can cause drooling, irritability, and gum discomfort. Use a clean teething ring or gently massage the gums to soothe discomfort."
        ],
        "action": "provide_teething_advice"
      },
      {
        "tag": "child_mental_health",
        "patterns": [
          "How do I support my child's mental health?",
          "What are the signs of anxiety in children?",
          "Why does my child seem sad?",
          "How do I talk to my child about their feelings?"
        ],
        "responses": [
          "Supporting a child's mental health involves open communication, validating their feelings, and creating a safe environment. For persistent sadness or anxiety, consider consulting a mental health professional."
        ],
        "action": "provide_mental_health_support"
      },
      {
        "tag": "child_hygiene",
        "patterns": [
          "How often should my child bathe?",
          "When should kids start brushing their teeth?",
          "How do I teach my child good hygiene?",
          "What hygiene practices should my child follow?"
        ],
        "responses": [
          "Children should bathe regularly, brush teeth twice a day, and wash hands frequently. Teach them hygiene through routines and leading by example."
        ],
        "action": "provide_hygiene_advice"
      }
    ]
  }
  