{
    "intents": [
      {
        "tag": "contraception_methods",
        "patterns": ["What are the different methods of contraception?", "Can you list the types of contraception?", "What contraception options are available?"],
        "responses": ["There are several methods of contraception including birth control pills, condoms, intrauterine devices (IUDs), implants, injections, patches, vaginal rings, and emergency contraception. Consult with your healthcare provider to choose the best option for you."],
        "action": "provide_contraception_methods_info"
      },
      {
        "tag": "birth_control_pills",
        "patterns": ["How do birth control pills work?", "What are the side effects of birth control pills?", "Are birth control pills effective?"],
        "responses": ["Birth control pills work by preventing ovulation and thickening cervical mucus. Common side effects include nausea, weight gain, mood changes, and breast tenderness. They are highly effective when taken correctly. Consult with your healthcare provider for more information."],
        "action": "provide_birth_control_pills_info"
      },
      {
        "tag": "condoms",
        "patterns": ["How do condoms work?", "Are condoms effective?", "What are the benefits of using condoms?"],
        "responses": ["Condoms work by creating a barrier that prevents sperm from reaching the egg. They are effective in preventing pregnancy and also protect against sexually transmitted infections (STIs). Condoms are easy to use and widely available."],
        "action": "provide_condoms_info"
      },
      {
        "tag": "iud",
        "patterns": ["What is an IUD?", "How does an IUD work?", "What are the side effects of an IUD?"],
        "responses": ["An intrauterine device (IUD) is a small, T-shaped device inserted into the uterus to prevent pregnancy. It can be hormonal or non-hormonal. Common side effects include cramping and irregular bleeding. IUDs are highly effective and can last for several years."],
        "action": "provide_iud_info"
      },
      {
        "tag": "implant",
        "patterns": ["What is a contraceptive implant?", "How does the implant work?", "What are the side effects of the implant?"],
        "responses": ["A contraceptive implant is a small rod inserted under the skin of the upper arm that releases hormones to prevent pregnancy. Common side effects include irregular bleeding, weight gain, and mood changes. The implant is highly effective and can last for up to three years."],
        "action": "provide_implant_info"
      },
      {
        "tag": "injection",
        "patterns": ["What is the contraceptive injection?", "How does the injection work?", "What are the side effects of the injection?"],
        "responses": ["The contraceptive injection is a shot given every three months that releases hormones to prevent pregnancy. Common side effects include weight gain, irregular bleeding, and mood changes. The injection is highly effective when received on schedule."],
        "action": "provide_injection_info"
      },
      {
        "tag": "patch",
        "patterns": ["What is the contraceptive patch?", "How does the patch work?", "What are the side effects of the patch?"],
        "responses": ["The contraceptive patch is a small adhesive patch that releases hormones to prevent pregnancy. It is worn on the skin and replaced weekly. Common side effects include skin irritation, nausea, and breast tenderness. The patch is highly effective when used correctly."],
        "action": "provide_patch_info"
      },
      {
        "tag": "vaginal_ring",
        "patterns": ["What is the vaginal ring?", "How does the vaginal ring work?", "What are the side effects of the vaginal ring?"],
        "responses": ["The vaginal ring is a small, flexible ring inserted into the vagina that releases hormones to prevent pregnancy. It is worn for three weeks and then removed for one week. Common side effects include vaginal irritation, nausea, and breast tenderness. The ring is highly effective when used correctly."],
        "action": "provide_vaginal_ring_info"
      },
      {
        "tag": "emergency_contraception",
        "patterns": ["What is emergency contraception?", "How does emergency contraception work?", "When should I use emergency contraception?"],
        "responses": ["Emergency contraception can be used to prevent pregnancy after unprotected sex or contraceptive failure. Options include the morning-after pill and the copper IUD. It is most effective when used as soon as possible after the incident. Consult with your healthcare provider for more information."],
        "action": "provide_emergency_contraception_info"
      },
      {
        "tag": "contraception_side_effects",
        "patterns": ["What are the side effects of contraception?", "Are there any risks with using contraception?", "What should I expect from using contraception?"],
        "responses": ["Side effects of contraception vary depending on the method. Common side effects include nausea, weight gain, mood changes, and irregular bleeding. It's important to discuss potential side effects with your healthcare provider to choose the best option for you."],
        "action": "provide_contraception_side_effects_info"
      },
      {
        "tag": "contraception_effectiveness",
        "patterns": ["How effective is contraception?", "What is the success rate of contraception?", "Which contraception method is most effective?"],
        "responses": ["The effectiveness of contraception varies by method. Long-acting reversible contraceptives like IUDs and implants are over 99% effective. Birth control pills, patches, and rings are about 91% effective with typical use. Condoms are about 85% effective with typical use. Consult with your healthcare provider to choose the best option for you."],
        "action": "provide_contraception_effectiveness_info"
      },
      {
        "tag": "contraception_myths",
        "patterns": ["What are some common myths about contraception?", "Are there any misconceptions about contraception?", "What should I know about contraception myths?"],
        "responses": ["There are many myths about contraception. It's important to rely on credible sources for information. Consult with your healthcare provider or trusted health organizations for accurate information."],
        "action": "provide_contraception_myths_info"
      },
      {
        "tag": "contraception_consultation",
        "patterns": ["How do I choose the right contraception?", "Can you help me choose a contraception method?", "What should I consider when choosing contraception?"],
        "responses": ["Choosing the right contraception depends on your health, lifestyle, and preferences. It's important to discuss your options with your healthcare provider to make an informed decision."],
        "action": "provide_contraception_consultation_info"
      },
      {
        "tag": "contraception_availability",
        "patterns": ["Where can I get contraception?", "How do I access contraception?", "Is contraception available over the counter?"],
        "responses": ["Contraception is available at pharmacies, clinics, and healthcare providers. Some methods, like condoms, are available over the counter, while others require a prescription. Consult with your healthcare provider for more information."],
        "action": "provide_contraception_availability_info"
      },
      {
        "tag": "contraception_cost",
        "patterns": ["How much does contraception cost?", "Is contraception covered by insurance?", "What are the costs associated with contraception?"],
        "responses": ["The cost of contraception varies depending on the method. The NHS covers most contraception for free. Consult with your healthcare provider."],
        "action": "provide_contraception_cost_info"
      }
    ]
  }