{
    "intents": [
        {
            "tag": "stomach_ache",
            "patterns": [
                "I have a stomach ache",
                "I have stomach pain",
                "I have cramps",
                "I have a stomach ache and nausea",
                "I have a stomach ache and diarrhea",
                "My stomach hurts",
                "I have a stomach ache and bloating"
            ],
            "responses": [
                "It sounds like you have a stomach ache. Rest, stay hydrated, and avoid foods that may irritate your stomach. If your symptoms persist, consult with your healthcare provider.",
                "Stomach aches can be caused by various factors. Rest, drink fluids, and avoid irritating foods. If your symptoms worsen, seek medical advice.",
                "Having a stomach ache can be uncomfortable. Rest, stay hydrated, and avoid foods that may irritate your stomach. If you have any concerns, contact your healthcare provider."
            ]
        },
        {
            "tag": "indigestion",
            "patterns": [
                "I have indigestion",
                "I have heartburn",
                "I have acid reflux",
                "I have bloating",
                "I have gas",
                "I have an upset stomach"
            ],
            "responses": [
                "It sounds like you have indigestion. Avoid spicy and fatty foods, eat smaller meals, and avoid lying down after eating. If your symptoms persist, consult with your healthcare provider.",
                "Indigestion can cause discomfort. Avoid irritating foods, eat smaller meals, and avoid lying down after eating. If your symptoms worsen, seek medical advice.",
                "Having indigestion can be uncomfortable. Avoid spicy and fatty foods, eat smaller meals, and avoid lying down after eating. If you have any concerns, contact your healthcare provider."
            ]
        },
        {
            "tag": "diarrhea",
            "patterns": [
                "I have diarrhea",
                "I have loose stools",
                "I have frequent bowel movements",
                "I have watery stools",
                "I have diarrhea and stomach cramps"
            ],
            "responses": [
                "It sounds like you have diarrhea. Stay hydrated, avoid dairy and fatty foods, and rest. If your symptoms persist or you experience severe dehydration, consult with your healthcare provider.",
                "Diarrhea can be caused by various factors. Stay hydrated, avoid irritating foods, and rest. If your symptoms worsen, seek medical advice.",
                "Having diarrhea can be uncomfortable. Stay hydrated, avoid dairy and fatty foods, and rest. If you have any concerns, contact your healthcare provider."
            ]
        },
        {
            "tag": "constipation",
            "patterns": [
                "I have constipation",
                "I am constipated",
                "I have difficulty passing stools",
                "I have hard stools",
                "I have infrequent bowel movements"
            ],
            "responses": [
                "It sounds like you have constipation. Increase your fiber intake, drink plenty of water, and exercise regularly. If your symptoms persist, consult with your healthcare provider.",
                "Constipation can be caused by various factors. Increase your fiber intake, drink fluids, and exercise regularly. If your symptoms worsen, seek medical advice.",
                "Having constipation can be uncomfortable. Increase your fiber intake, drink plenty of water, and exercise regularly. If you have any concerns, contact your healthcare provider."
            ]
        },
        {
            "tag": "nausea",
            "patterns": [
                "I feel nauseous",
                "I have nausea",
                "I feel like vomiting",
                "I have an upset stomach",
                "I feel queasy"
            ],
            "responses": [
                "It sounds like you have nausea. Rest, stay hydrated, and avoid strong odors and spicy foods. If your symptoms persist, consult with your healthcare provider.",
                "Nausea can be caused by various factors. Rest, drink fluids, and avoid irritating foods. If your symptoms worsen, seek medical advice.",
                "Having nausea can be uncomfortable. Rest, stay hydrated, and avoid strong odors and spicy foods. If you have any concerns, contact your healthcare provider."
            ]
        },
        {
            "tag": "vomiting",
            "patterns": [
                "I am vomiting",
                "I have been throwing up",
                "I can't keep anything down",
                "I feel like vomiting",
                "I have nausea and vomiting"
            ],
            "responses": [
                "It sounds like you are vomiting. Stay hydrated, rest, and avoid solid foods until you feel better. If your symptoms persist or you experience severe dehydration, consult with your healthcare provider.",
                "Vomiting can be caused by various factors. Stay hydrated, rest, and avoid solid foods until you feel better. If your symptoms worsen, seek medical advice.",
                "Having vomiting can be uncomfortable. Stay hydrated, rest, and avoid solid foods until you feel better. If you have any concerns, contact your healthcare provider."
            ]
        }
    ]
}