{
    "intents": [
        {
            "tag": "fever",
            "patterns": [
                "I have a fever",
                "I am running a fever",
                "My temperature is high",
                "I feel hot",
                "I have a high temperature",
                "I think I have a fever",
                "I am feeling feverish",
                "I have a fever and feel weak",
                "I have a fever and chills",
                "I have a fever and body aches"
            ],
            "responses": [
                "I'm sorry to hear that you have a fever. It's important to rest and stay hydrated. If your fever persists or is very high, please consult with your healthcare provider.",
                "Having a fever can be uncomfortable. Make sure to drink plenty of fluids and rest. If your symptoms worsen, seek medical attention.",
                "A fever can be a sign of an infection. Monitor your temperature and take over-the-counter fever reducers if necessary. Contact your doctor if your fever is very high or doesn't go away.",
                "It's important to take care of yourself when you have a fever. Rest, stay hydrated, and avoid strenuous activities. If you have other symptoms or your fever is very high, consult with a healthcare professional.",
                "Fever can be a symptom of various conditions. Keep track of your temperature and rest. If you experience severe symptoms or your fever lasts for more than a couple of days, seek medical advice."
            ]
        },
        {
            "tag": "fever_with_cough",
            "patterns": [
                "I have a fever and a cough",
                "I am coughing and have a fever",
                "I have a high temperature and a cough",
                "I feel hot and have a cough",
                "I have a fever and a persistent cough"
            ],
            "responses": [
                "A fever and cough can be symptoms of a respiratory infection. It's important to rest, stay hydrated, and monitor your symptoms. If you have difficulty breathing or your symptoms worsen, seek medical attention immediately.",
                "Having both a fever and a cough can be concerning. Make sure to drink plenty of fluids and rest. If your symptoms persist or worsen, contact your healthcare provider.",
                "A fever and cough may indicate an infection. Rest, stay hydrated, and take over-the-counter medications to relieve your symptoms. If you experience severe symptoms, seek medical advice.",
                "It's important to take care of yourself when you have a fever and cough. Rest, drink fluids, and avoid contact with others to prevent spreading any potential infection. If your symptoms worsen, consult with a healthcare professional."
            ]
        },
        {
            "tag": "fever_with_body_aches",
            "patterns": [
                "I have a fever and body aches",
                "My body aches and I have a fever",
                "I feel sore and have a fever",
                "I have a high temperature and body pain",
                "I have a fever and muscle aches"
            ],
            "responses": [
                "Fever and body aches can be symptoms of the flu or other infections. Rest, stay hydrated, and take over-the-counter pain relievers if needed. If your symptoms persist or worsen, seek medical advice.",
                "Having a fever and body aches can be uncomfortable. Make sure to rest and drink plenty of fluids. If your symptoms don't improve or get worse, contact your healthcare provider.",
                "Fever and body aches may indicate an infection. Rest, stay hydrated, and take medications to relieve your symptoms. If you experience severe symptoms, seek medical attention.",
                "It's important to take care of yourself when you have a fever and body aches. Rest, drink fluids, and avoid strenuous activities. If your symptoms worsen, consult with a healthcare professional."
            ]
        },
        {
            "tag": "fever_with_chills",
            "patterns": [
                "I have a fever and chills",
                "I am shivering and have a fever",
                "I feel cold and have a fever",
                "I have a high temperature and chills",
                "I have a fever and feel cold"
            ],
            "responses": [
                "Fever and chills can be symptoms of an infection. Make sure to rest, stay warm, and drink plenty of fluids. If your symptoms persist or worsen, seek medical attention.",
                "Having a fever and chills can be uncomfortable. Rest, stay hydrated, and keep warm. If your symptoms don't improve or get worse, contact your healthcare provider.",
                "Fever and chills may indicate an infection. Rest, stay warm, and drink fluids. If you experience severe symptoms, seek medical advice.",
                "It's important to take care of yourself when you have a fever and chills. Rest, stay warm, and avoid strenuous activities. If your symptoms worsen, consult with a healthcare professional."
            ]
        }
    ]
}