{
    "intents": [
        {
            "tag": "mental_health_general",
            "patterns": [
                "How can I improve my mental health?",
                "What are the benefits of good mental health?",
                "How can I take care of my mental health?",
                "What is mental health?",
                "Why is mental health important?"
            ],
            "responses": [
                "To improve your mental health, practice self-care, stay connected with loved ones, engage in regular physical activity, get enough sleep, and seek professional help if needed.",
                "Good mental health is important for overall well-being. It helps with emotional regulation, stress management, cognitive function, and maintaining healthy relationships.",
                "Taking care of your mental health involves practicing self-care, staying connected with loved ones, engaging in regular physical activity, getting enough sleep, and seeking professional help if needed.",
                "Mental health refers to your emotional, psychological, and social well-being. It affects how you think, feel, and act, and it plays a role in how you handle stress, relate to others, and make choices.",
                "Mental health is important because it affects every aspect of your life, including your emotional well-being, relationships, and physical health. Taking care of your mental health is essential for overall well-being."
            ]
        },
        {
            "tag": "stress_management",
            "patterns": [
                "How can I reduce stress?",
                "What are tips for managing stress?",
                "How can I cope with stress?",
                "What are ways to relieve stress?",
                "How can I handle stress better?"
            ],
            "responses": [
                "To reduce stress, practice relaxation techniques like deep breathing, meditation, and yoga. Stay organized, set realistic goals, and make time for activities you enjoy.",
                "Managing stress involves practicing relaxation techniques, staying physically active, maintaining a healthy diet, and seeking support from friends and family. Consider talking to a mental health professional if needed.",
                "Coping with stress can be challenging. Practice relaxation techniques, stay physically active, maintain a healthy diet, and seek support from friends and family. Consider talking to a mental health professional if needed.",
                "To relieve stress, engage in activities you enjoy, practice relaxation techniques, stay physically active, and maintain a healthy diet. Seek support from friends and family if needed.",
                "Handling stress better involves practicing relaxation techniques, staying physically active, maintaining a healthy diet, and seeking support from friends and family. Consider talking to a mental health professional if needed."
            ]
        },
        {
            "tag": "anxiety_management",
            "patterns": [
                "How can I manage anxiety?",
                "What are tips for managing anxiety?",
                "How can I reduce anxiety?",
                "What are ways to cope with anxiety?",
                "How can I handle anxiety better?"
            ],
            "responses": [
                "To manage anxiety, practice relaxation techniques like deep breathing, meditation, and yoga. Stay physically active, maintain a healthy diet, and seek support from friends and family. Consider talking to a mental health professional if needed.",
                "Managing anxiety involves practicing relaxation techniques, staying physically active, maintaining a healthy diet, and seeking support from friends and family. Consider talking to a mental health professional if needed.",
                "Reducing anxiety can be challenging. Practice relaxation techniques, stay physically active, maintain a healthy diet, and seek support from friends and family. Consider talking to a mental health professional if needed.",
                "To cope with anxiety, engage in activities you enjoy, practice relaxation techniques, stay physically active, and maintain a healthy diet. Seek support from friends and family if needed.",
                "Handling anxiety better involves practicing relaxation techniques, staying physically active, maintaining a healthy diet, and seeking support from friends and family. Consider talking to a mental health professional if needed."
            ]
        },
        {
            "tag": "depression_management",
            "patterns": [
                "How can I cope with depression?",
                "What are tips for managing depression?",
                "How can I reduce depression?",
                "What are ways to deal with depression?",
                "How can I handle depression better?"
            ],
            "responses": [
                "Coping with depression can be challenging. Seek professional help, stay connected with supportive friends and family, engage in regular physical activity, and practice self-care. Avoid isolating yourself and reach out for support.",
                "Managing depression involves seeking professional help, staying connected with supportive friends and family, engaging in regular physical activity, and practicing self-care. Avoid isolating yourself and reach out for support.",
                "Reducing depression can be difficult. Seek professional help, stay connected with supportive friends and family, engage in regular physical activity, and practice self-care. Avoid isolating yourself and reach out for support.",
                "Dealing with depression involves seeking professional help, staying connected with supportive friends and family, engaging in regular physical activity, and practicing self-care. Avoid isolating yourself and reach out for support.",
                "Handling depression better involves seeking professional help, staying connected with supportive friends and family, engaging in regular physical activity, and practicing self-care. Avoid isolating yourself and reach out for support."
            ]
        },
        {
            "tag": "self_care",
            "patterns": [
                "What are ways to practice self-care?",
                "How can I practice self-care?",
                "What are self-care tips?",
                "How can I take care of myself?",
                "What is self-care?"
            ],
            "responses": [
                "Practicing self-care involves making time for activities you enjoy, staying physically active, getting enough sleep, and maintaining a healthy diet. Stay connected with supportive friends and family and seek professional help if needed.",
                "To practice self-care, make time for activities you enjoy, stay physically active, get enough sleep, and maintain a healthy diet. Stay connected with supportive friends and family and seek professional help if needed.",
                "Self-care tips include making time for activities you enjoy, staying physically active, getting enough sleep, and maintaining a healthy diet. Stay connected with supportive friends and family and seek professional help if needed.",
                "Taking care of yourself involves making time for activities you enjoy, staying physically active, getting enough sleep, and maintaining a healthy diet. Stay connected with supportive friends and family and seek professional help if needed.",
                "Self-care refers to the practice of taking action to preserve or improve your own health. It involves making time for activities you enjoy, staying physically active, getting enough sleep, and maintaining a healthy diet."
            ]
        },
        {
            "tag": "mood_boost",
            "patterns": [
                "How can I boost my mood?",
                "What are ways to improve my mood?",
                "How can I feel happier?",
                "What are tips for feeling better?",
                "How can I lift my spirits?"
            ],
            "responses": [
                "To boost your mood, engage in activities you enjoy, stay physically active, get enough sleep, and practice gratitude. Stay connected with loved ones and seek professional help if needed.",
                "Improving your mood involves engaging in activities you enjoy, staying physically active, getting enough sleep, and practicing gratitude. Stay connected with loved ones and seek professional help if needed.",
                "Feeling happier can be achieved by engaging in activities you enjoy, staying physically active, getting enough sleep, and practicing gratitude. Stay connected with loved ones and seek professional help if needed.",
                "Tips for feeling better include engaging in activities you enjoy, staying physically active, getting enough sleep, and practicing gratitude. Stay connected with loved ones and seek professional help if needed.",
                "Lifting your spirits involves engaging in activities you enjoy, staying physically active, getting enough sleep, and practicing gratitude. Stay connected with loved ones and seek professional help if needed."
            ]
        }
    ]
}