{
    "intents": [
      {
        "tag": "sickness_symptoms",
        "patterns": ["What are the symptoms of sickness?", "How do I know if I am sick?", "What should I look for with sickness?"],
        "responses": ["Common symptoms of sickness include nausea, vomiting, stomach cramps, fever, and fatigue. These symptoms can be caused by various factors such as infections, food poisoning, or underlying medical conditions."],
        "action": "provide_sickness_symptoms_info"
      },
      {
        "tag": "diarrhoea_symptoms",
        "patterns": ["What are the symptoms of diarrhoea?", "How do I know if I have diarrhoea?", "What should I look for with diarrhoea?"],
        "responses": ["Common symptoms of diarrhoea include frequent loose or watery stools, stomach cramps, bloating, nausea, and urgency to have a bowel movement. Diarrhoea can be caused by infections, food intolerance, or other medical conditions."],
        "action": "provide_diarrhoea_symptoms_info"
      },
      {
        "tag": "sickness_causes",
        "patterns": ["What causes sickness?", "How does sickness occur?", "What are the common causes of sickness?"],
        "responses": ["Sickness can be caused by infections, food poisoning, motion sickness, pregnancy, stress, and certain medications. It's important to identify the underlying cause to determine the appropriate treatment."],
        "action": "provide_sickness_causes_info"
      },
      {
        "tag": "diarrhoea_causes",
        "patterns": ["What causes diarrhoea?", "How does diarrhoea occur?", "What are the common causes of diarrhoea?"],
        "responses": ["Diarrhoea can be caused by infections, food intolerance, certain medications, digestive disorders, and stress. Identifying the underlying cause is important for proper treatment."],
        "action": "provide_diarrhoea_causes_info"
      },
      {
        "tag": "sickness_prevention",
        "patterns": ["How can I prevent sickness?", "What are the preventive measures for sickness?", "How do I protect myself from sickness?"],
        "responses": ["To prevent sickness, practice good hygiene, avoid contaminated food and water, manage stress, and get vaccinated against common infections. It's also important to maintain a healthy lifestyle with a balanced diet and regular exercise."],
        "action": "provide_sickness_prevention_info"
      },
      {
        "tag": "diarrhoea_prevention",
        "patterns": ["How can I prevent diarrhoea?", "What are the preventive measures for diarrhoea?", "How do I protect myself from diarrhoea?"],
        "responses": ["To prevent diarrhoea, practice good hygiene, avoid contaminated food and water, manage stress, and get vaccinated against common infections. It's also important to maintain a healthy lifestyle with a balanced diet and regular exercise."],
        "action": "provide_diarrhoea_prevention_info"
      },
      {
        "tag": "sickness_treatment",
        "patterns": ["What is the treatment for sickness?", "How is sickness treated?", "What should I do if I am sick?"],
        "responses": ["Treatment for sickness may include rest, hydration, over-the-counter medications to relieve symptoms, and avoiding solid foods until vomiting stops. It's important to consult with your healthcare provider for proper diagnosis and treatment."],
        "action": "provide_sickness_treatment_info"
      },
      {
        "tag": "diarrhoea_treatment",
        "patterns": ["What is the treatment for diarrhoea?", "How is diarrhoea treated?", "What should I do if I have diarrhoea?"],
        "responses": ["Treatment for diarrhoea may include rest, hydration, over-the-counter medications to relieve symptoms, and avoiding certain foods that can worsen diarrhoea. It's important to consult with your healthcare provider for proper diagnosis and treatment."],
        "action": "provide_diarrhoea_treatment_info"
      },
      {
        "tag": "sickness_duration",
        "patterns": ["How long does sickness last?", "What is the recovery time for sickness?", "When will I feel better after being sick?"],
        "responses": ["The duration of sickness varies depending on the cause. Most minor illnesses improve within a few days to a week with proper care. If symptoms persist, consult with your healthcare provider."],
        "action": "provide_sickness_duration_info"
      },
      {
        "tag": "diarrhoea_duration",
        "patterns": ["How long does diarrhoea last?", "What is the recovery time for diarrhoea?", "When will I feel better after having diarrhoea?"],
        "responses": ["The duration of diarrhoea varies depending on the cause. Most cases improve within a few days with proper care. If symptoms persist, consult with your healthcare provider."],
        "action": "provide_diarrhoea_duration_info"
      },
      {
        "tag": "sickness_complications",
        "patterns": ["What are the complications of sickness?", "Can sickness cause serious health issues?", "What should I know about sickness complications?"],
        "responses": ["Complications of sickness can include dehydration, electrolyte imbalances, and worsening of underlying medical conditions. It's important to seek medical attention if you experience severe symptoms or if symptoms persist."],
        "action": "provide_sickness_complications_info"
      },
      {
        "tag": "diarrhoea_complications",
        "patterns": ["What are the complications of diarrhoea?", "Can diarrhoea cause serious health issues?", "What should I know about diarrhoea complications?"],
        "responses": ["Complications of diarrhoea can include dehydration, electrolyte imbalances, and worsening of underlying medical conditions. It's important to seek medical attention if you experience severe symptoms or if symptoms persist."],
        "action": "provide_diarrhoea_complications_info"
      },
      {
        "tag": "sickness_risk_factors",
        "patterns": ["Who is at risk for sickness?", "What are the risk factors for sickness?", "Am I at risk for sickness?"],
        "responses": ["People at higher risk for sickness include young children, elderly individuals, those with weakened immune systems, and people who are frequently exposed to infections. It's important to take preventive measures to reduce your risk."],
        "action": "provide_sickness_risk_factors_info"
      },
      {
        "tag": "diarrhoea_risk_factors",
        "patterns": ["Who is at risk for diarrhoea?", "What are the risk factors for diarrhoea?", "Am I at risk for diarrhoea?"],
        "responses": ["People at higher risk for diarrhoea include young children, elderly individuals, those with weakened immune systems, and people who are frequently exposed to infections. It's important to take preventive measures to reduce your risk."],
        "action": "provide_diarrhoea_risk_factors_info"
      },
      {
        "tag": "sickness_vs_diarrhoea",
        "patterns": ["What is the difference between sickness and diarrhoea?", "How can I tell if I have sickness or diarrhoea?", "Is it sickness or diarrhoea?"],
        "responses": ["Sickness generally refers to nausea and vomiting, while diarrhoea involves frequent loose or watery stools. Both conditions can occur together and may have similar causes. It's important to seek medical attention for proper diagnosis and treatment."],
        "action": "provide_sickness_vs_diarrhoea_info"
      },
      {
        "tag": "sickness_myths",
        "patterns": ["What are some common myths about sickness?", "Are there any misconceptions about sickness?", "What should I know about sickness myths?"],
        "responses": ["There are many myths about sickness. It's important to rely on credible sources for information. Consult with your healthcare provider or trusted health organizations for accurate information."],
        "action": "provide_sickness_myths_info"
      },
      {
        "tag": "diarrhoea_myths",
        "patterns": ["What are some common myths about diarrhoea?", "Are there any misconceptions about diarrhoea?", "What should I know about diarrhoea myths?"],
        "responses": ["There are many myths about diarrhoea. It's important to rely on credible sources for information. Consult with your healthcare provider or trusted health organizations for accurate information."],
        "action": "provide_diarrhoea_myths_info"
      },
      {
        "tag": "sickness_home_remedies",
        "patterns": ["Are there any home remedies for sickness?", "Can I treat sickness at home?", "What home remedies can help with sickness?"],
        "responses": ["Home remedies for sickness include staying hydrated, eating bland foods, getting plenty of rest, and using over-the-counter medications to relieve symptoms. However, it's important to consult with your healthcare provider for proper diagnosis and treatment."],
        "action": "provide_sickness_home_remedies_info"
      },
      {
        "tag": "diarrhoea_home_remedies",
        "patterns": ["Are there any home remedies for diarrhoea?", "Can I treat diarrhoea at home?", "What home remedies can help with diarrhoea?"],
        "responses": ["Home remedies for diarrhoea include staying hydrated, eating bland foods, getting plenty of rest, and using over-the-counter medications to relieve symptoms. However, it's important to consult with your healthcare provider for proper diagnosis and treatment."],
        "action": "provide_diarrhoea_home_remedies_info"
      },
      {
        "tag": "sickness_follow_up",
        "patterns": ["What should I do after being sick?", "Is there any follow-up needed after sickness?", "What are the next steps after being sick?"],
        "responses": ["After being sick, it's important to continue practicing preventive measures such as good hygiene and a healthy lifestyle. If symptoms persist or worsen, consult with your healthcare provider."],
        "action": "provide_sickness_follow_up_info"
      },
      {
        "tag": "diarrhoea_follow_up",
        "patterns": ["What should I do after having diarrhoea?", "Is there any follow-up needed after diarrhoea?", "What are the next steps after having diarrhoea?"],
        "responses": ["After having diarrhoea, it's important to continue practicing preventive measures such as good hygiene and a healthy lifestyle. If symptoms persist or worsen, consult with your healthcare provider."],
        "action": "provide_diarrhoea_follow_up_info"
      },
      {
        "tag": "sickness_in_children",
        "patterns": ["How does sickness affect children?", "What should I know about sickness in children?", "Is sickness common in children?"],
        "responses": ["Sickness can affect children and may be caused by infections, food poisoning, or other factors. It's important to seek medical attention for proper diagnosis and treatment."],
        "action": "provide_sickness_in_children_info"
      },
      {
        "tag": "diarrhoea_in_children",
        "patterns": ["How does diarrhoea affect children?", "What should I know about diarrhoea in children?", "Is diarrhoea common in children?"],
        "responses": ["Diarrhoea can affect children and may be caused by infections, food intolerance, or other factors. It's important to seek medical attention for proper diagnosis and treatment."],
        "action": "provide_diarrhoea_in_children_info"
      },
      {
        "tag": "sickness_in_adults",
        "patterns": ["Can adults get sick?", "What should I know about sickness in adults?", "Is sickness common in adults?"],
        "responses": ["Sickness can affect adults and may be caused by infections, food poisoning, or other factors. It's important to seek medical attention for proper diagnosis and treatment."],
        "action": "provide_sickness_in_adults_info"
      },
      {
        "tag": "diarrhoea_in_adults",
        "patterns": ["Can adults get diarrhoea?", "What should I know about diarrhoea in adults?", "Is diarrhoea common in adults?"],
        "responses": ["Diarrhoea can affect adults and may be caused by infections, food intolerance, or other factors. It's important to seek medical attention for proper diagnosis and treatment."],
        "action": "provide_diarrhoea_in_adults_info"
      }
    ]
  }