{
    "intents": [
      {
        "tag": "smear_test_purpose",
        "patterns": ["What is a smear test?", "Why do I need a smear test?", "What is the purpose of a Pap smear?"],
        "responses": ["A smear test, also known as a Pap smear, is a procedure to test for cervical cancer in women. It involves collecting cells from your cervix to detect any abnormalities that may indicate cancer or precancerous conditions."],
        "action": "provide_smear_test_purpose_info"
      },
      {
        "tag": "smear_test_frequency",
        "patterns": ["How often should I get a smear test?", "How frequently do I need a Pap smear?", "When should I have a smear test?"],
        "responses": ["It is generally recommended that women start getting smear tests at age 21 and continue every three years if results are normal. Women aged 30 and older may switch to every five years if combined with HPV testing. Consult with your healthcare provider for personalized advice."],
        "action": "provide_smear_test_frequency_info"
      },
      {
        "tag": "smear_test_preparation",
        "patterns": ["How do I prepare for a smear test?", "What should I do before a Pap smear?", "Is there any preparation needed for a smear test?"],
        "responses": ["To prepare for a smear test, avoid intercourse, douching, or using any vaginal medicines or spermicidal foams for two days before the test. It's best to schedule the test when you are not menstruating."],
        "action": "provide_smear_test_preparation_info"
      },
      {
        "tag": "smear_test_procedure",
        "patterns": ["What happens during a smear test?", "How is a Pap smear performed?", "What should I expect during a smear test?"],
        "responses": ["During a smear test, you will lie on an exam table and a speculum will be inserted into your vagina to widen it. A small brush or spatula is used to collect cells from your cervix. The procedure is usually quick and may cause mild discomfort."],
        "action": "provide_smear_test_procedure_info"
      },
      {
        "tag": "smear_test_results",
        "patterns": ["How long does it take to get smear test results?", "What do my Pap smear results mean?", "When will I get my smear test results?"],
        "responses": ["Smear test results are usually available within a few days to a week. Normal results mean no abnormal cells were found. Abnormal results do not necessarily mean cancer but may require further testing. Consult with your healthcare provider to understand your results."],
        "action": "provide_smear_test_results_info"
      },
      {
        "tag": "smear_test_abnormal_results",
        "patterns": ["What happens if my smear test results are abnormal?", "What do abnormal Pap smear results mean?", "Should I be worried about abnormal smear test results?"],
        "responses": ["Abnormal smear test results indicate that changes in cervical cells were found. This does not mean you have cancer, but further testing such as a colposcopy or biopsy may be needed. Consult with your healthcare provider for more information."],
        "action": "provide_smear_test_abnormal_results_info"
      },
      {
        "tag": "smear_test_risks",
        "patterns": ["Are there any risks associated with a smear test?", "What are the risks of a Pap smear?", "Is a smear test safe?"],
        "responses": ["A smear test is generally safe and complications are rare. Some women may experience mild discomfort or light bleeding after the test. If you have any concerns, consult with your healthcare provider."],
        "action": "provide_smear_test_risks_info"
      },
      {
        "tag": "smear_test_importance",
        "patterns": ["Why is a smear test important?", "What are the benefits of a Pap smear?", "Why should I get a smear test?"],
        "responses": ["A smear test is important because it helps detect cervical cancer and precancerous conditions early when they are most treatable. Regular screening can significantly reduce the risk of developing cervical cancer."],
        "action": "provide_smear_test_importance_info"
      },
      {
        "tag": "smear_test_cost",
        "patterns": ["How much does a smear test cost?", "Is a Pap smear covered by insurance?", "What are the costs associated with a smear test?"],
        "responses": ["The cost of a smear test varies depending on your location and healthcare provider. Many insurance plans cover the cost of routine Pap smears. Consult with your healthcare provider or insurance company for more information."],
        "action": "provide_smear_test_cost_info"
      },
      {
        "tag": "smear_test_availability",
        "patterns": ["Where can I get a smear test?", "How do I schedule a Pap smear?", "Is a smear test available at my clinic?"],
        "responses": ["Smear tests are available at most healthcare facilities, including clinics, hospitals, and gynecologist offices. Contact your healthcare provider to schedule an appointment."],
        "action": "provide_smear_test_availability_info"
      },
      {
        "tag": "smear_test_myths",
        "patterns": ["What are some common myths about smear tests?", "Are there any misconceptions about Pap smears?", "What should I know about smear test myths?"],
        "responses": ["There are many myths about smear tests. It's important to rely on credible sources for information. Consult with your healthcare provider or trusted health organizations for accurate information."],
        "action": "provide_smear_test_myths_info"
      },
      {
        "tag": "smear_test_eligibility",
        "patterns": ["Who should get a smear test?", "Am I eligible for a Pap smear?", "What are the eligibility criteria for a smear test?"],
        "responses": ["Women aged 21 and older should start getting smear tests. The frequency of testing depends on age, health history, and previous test results. Consult with your healthcare provider to determine your eligibility and screening schedule."],
        "action": "provide_smear_test_eligibility_info"
      },
      {
        "tag": "smear_test_follow_up",
        "patterns": ["What should I do after a smear test?", "Is there any follow-up needed after a Pap smear?", "What are the next steps after a smear test?"],
        "responses": ["After a smear test, you may experience mild discomfort or light bleeding. Follow your healthcare provider's instructions and schedule any necessary follow-up appointments based on your test results."],
        "action": "provide_smear_test_follow_up_info"
      }
    ]
  }